export default {
  navigation: {
    home: 'Главная',
    projects: 'Проекты',
    sectants: 'Сектанты',
    about: 'Обо мне',
    contact: 'Контакты',
    back_to_projects: 'Назад к Проектам'
  },
  home: {
    hero: {
      title: 'От идеи до результата',
      subtitle: 'Воплощаю идеи в жизнь с помощью приложений и инструментов',
      cta: 'Смотреть проекты'
    },
    about: {
      title: 'Обо мне',
      description: 'Добро пожаловать! Я занимаюсь разработкой приложений и созданием инструментов.\nВдохновляюсь технологиями и музыкой, чтобы воплощать идеи в жизнь. Мои проекты, такие как FF Sensitivities, MC Tools и EverBook, созданы для удобства и удовольствия пользователей. Исследуйте мои работы и следите за новинками!'
    },
    projects: {
      title: 'Избранные проекты',
      viewAll: 'Все проекты'
    },
    sectants: {
      title: 'Присоединяйся к Внутреннему Кругу',
      description: 'Познакомьтесь с элитной командой цифровых мастеров, формирующих будущее через код и творчество.',
      cta: 'Встретить Сектантов'
    }
  },
  projects: {
    title: 'Мои проекты',
    description: 'Здесь собраны все мои проекты — от мобильных приложений до веб- и Telegram-инструментов. Каждый из них создан для решения реальных задач и улучшения пользовательского опыта.',
    searchPlaceholder: 'Поиск проектов...',
    sortBy: 'Сортировать по',
    sortOptions: {
      newest: 'Сначала новые',
      title: 'Названию',
      category: 'Категории'
    },
    categories: {
      all: 'Все',
      android_apps: 'Android приложения',
      web_apps: 'Веб-приложения'
    },
    noResults: 'Проекты по заданным критериям не найдены',
    card: {
      learnMore: 'Подробнее'
    }
  },
  everbook: {
    title: 'EverBook',
    description: 'EverBook — удобный ридер электронных книг с поддержкой множества форматов.',
    features: {
      title: 'Ключевые особенности',
      list: {
        1: 'Поддержка популярных форматов: PDF, EPUB, TXT, FB2 и другие 📄',
        2: 'Полная настройка ридера: выбирайте шрифты, цветовые темы и другие настройки для вашего удобства 👓',
        3: 'Организованная библиотека: сортировка по категориям и поддержка глав 📚',
        4: 'Персональные настройки: создайте уникальный опыт чтения с помощью кастомных цветов и тем 🎨',
        5: 'Мгновенный перевод: дважды нажмите, чтобы перевести текст с помощью внешнего переводчика 🌍',
        6: 'Оптимизация для планшетов: интерфейс, адаптированный для больших экранов 📱',
        7: 'Простой и интуитивно понятный интерфейс: читайте с легкостью, никаких сложных настроек 🔧',
        8: 'Автоматические обновления: приложение уведомит вас о новых версиях при запуске 🔄'
      }
    },
    technologies: {
      title: 'Используемые технологии'
    },
    screenshots: {
      title: 'Скриншоты',
      main: 'Главный экран',
      detail: 'Детальный просмот',
      settings: 'Настройки'
    },
    buttons: {
      source: 'Исходный код',
      demo: 'Попробовать демо',
      googlePlay: 'Скачать в Google Play',
      ruStore: 'Скачать в RuStore'
    }
  },
  ffsensitivities: {
    title: 'FF Sensitivities',
    description: 'Настройки чувствительности для более точных хедшотов!',
    features: {
      title: 'Ключевые особенности',
      list: {
        1: 'Облачная технология: Новые настройки появляются без необходимости обновления приложения ☁️',
        2: 'Поддержка нескольких языков: Приложение поддерживает множество языков, регулярно добавляются новые 🌍',
        3: 'Поддержка нескольких производителей: Поддержка устройств от более чем 12 различных производителей 📱',
        4: 'Минималистичный интерфейс: Простой и удобный дизайн без лишних элементов ✨',
        5: 'Простота использования: Интуитивно понятный интерфейс позволяет использовать функции без лишних сложностей ⚡',
        6: 'Автоматические обновления: Приложение уведомит вас о новых версиях при запуске 🔄'
      }      
    },
    technologies: {
      title: 'Используемые технологии'
    },
    screenshots: {
      title: 'Скриншоты',
      main: 'Главный экран',
      detail: 'Детальный просмот',
      settings: 'Настройки'
    },
    buttons: {
      source: 'Исходный код',
      demo: 'Попробовать демо',
      googlePlay: 'Скачать в Google Play',
      ruStore: 'Скачать в RuStore'
    }
  },
  mctools: {
    title: 'MC Tools',
    description: 'Это коллекция мощных инструментов для Minecraft!',
    features: {
      title: 'Ключевые особенности',
      list: {
        1: 'Калькулятор координат Стронгхолда: Быстрый и точный инструмент для определения местоположения Стронгхолда 🧭',
        2: 'Мониторинг серверов Minecraft: Легко проверяйте статус серверов и их доступность в реальном времени 🌐',
        3: 'Минималистичный интерфейс: Простой и удобный дизайн без лишних элементов ✨'
      }      
    },
    technologies: {
      title: 'Используемые технологии'
    },
    screenshots: {
      title: 'Скриншоты',
      main: 'Главный экран',
      detail: 'Детальный просмот',
      settings: 'Настройки'
    },
    buttons: {
      source: 'Исходный код',
      demo: 'Попробовать',
      googlePlay: 'Скачать в Google Play',
      ruStore: 'Скачать в RuStore'
    }
  },
  sectants: {
    title: 'Сектанты',
    description: 'Тайное общество которое создает код и формирует цифровую реальность',
    members: {
      title: 'Наш Священный Орден',
      skills: 'Мистические Искусства',
      projects: 'Запретные Работы'
    }
  },
  about: {
    title: 'Обо мне',
    subtitle: 'Мой путь в программировании начался с создания модов для Minecraft PE под загрузчик модов InnerCore, ныне известный как Horizon. Во время работы я познакомился с крутыми людьми, которые значительно помогли мне развить навыки программирования. Мы стали командой друзей, придумавшей себе звание "Сектанты". С тех пор я продолжаю создавать приложения и инструменты, вдохновляясь технологиями и музыкой. Узнайте больше о моём опыте и подходе к разработке!',
    description: 'С опытом в современных веб-технологиях, я воплощаю идеи в жизнь через чистый код и интуитивный дизайн.',
    name: 'Ибрагим',
    skills: {
      frontend: 'Фронтенд',
      backend: 'Бэкенд',
      tools: 'Инструменты',
      other: 'Другое'
    },
    quote: 'Каждый проект — это не просто код, это возможность сделать мир немного удобнее и интереснее'
  },
  contact: {
    title: 'Контакты и Обратная связь',
    subtitle: 'Если у вас есть вопросы или предложения, не стесняйтесь связаться со мной! Я всегда открыт для новых идей и сотрудничества. Используйте форму ниже или свяжитесь через соцсети, чтобы обсудить проекты, возможности или просто познакомиться.',
    description: 'Не стесняйтесь обращаться через любой из каналов связи ниже.',
    location: {
      title: 'Локация и время',
      place: 'Biała Podlaska, PL',
      timezone: 'CET (GMT+1)'
    },
    social: {
      title: 'Социальные сети',
      github: 'GitHub',
      linkedin: 'LinkedIn',
      twitter: 'Twitter',
      email: 'Email'
    },
    form: {
      title: 'Отправить сообщение',
      name: {
        label: 'Имя',
        placeholder: 'Введите ваше имя'
      },
      email: {
        label: 'Email',
        placeholder: 'Введите ваш email'
      },
      message: {
        label: 'Сообщение',
        placeholder: 'Введите ваше сообщение'
      },
      submit: 'Отправить',
      success: 'Сообщение успешно отправлено!',
      error: 'Не удалось отправить сообщение. Пожалуйста, попробуйте снова.'
    }
  }
};